wegam/STM32F10xUSBW/FWLIB/Lib/Protocol/USART_ISP.C
	}
	else if(C0==ISP_COMMAND_GetVS)	//获取自举程序版本及 Flash 的读保护状态
	{
		ISP_Conf->ISP_DATA.ISP_TvBuffer[0]=ISP_ANSWER_ACK;		//应答
		ISP_Conf->ISP_DATA.ISP_TvBuffer[1]=0x22;							//自举程序版本（0 < 版本 ≤ 255），示例：0x10 = 版本 1.0
		ISP_Conf->ISP_DATA.ISP_TvBuffer[2]=0x00;							//选项字节 1：0x00，保持与通用自举程序协议的兼容性
		ISP_Conf->ISP_DATA.ISP_TvBuffer[3]=0x00;							//选项字节 2：0x00，保持与通用自举程序协议的兼容性
		ISP_Conf->ISP_DATA.ISP_TvBuffer[4]=ISP_ANSWER_ACK;		//应答
		
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitCommand;		//ISP等待命令（作为从机)--处理完GetVS命令后等待下一下命令
		rxNum=5;			//上报数据大小
	}
	else if(C0==ISP_COMMAND_GetID)	//获取芯片 ID
	{
		ISP_Conf->ISP_DATA.ISP_TvBuffer[0]=ISP_ANSWER_ACK;		//应答
		ISP_Conf->ISP_DATA.ISP_TvBuffer[1]=0x01;							//N = 字节数 – 1（对 STM32 N = 1），除当前字节和 ACK 之外。
		ISP_Conf->ISP_DATA.ISP_TvBuffer[2]=0x04;							//PID(1) 字节 3 = 0x04，字节 4 = 0xXX
		ISP_Conf->ISP_DATA.ISP_TvBuffer[3]=0x10;							//PID(1) 字节 3 = 0x04，字节 4 = 0xXX
		ISP_Conf->ISP_DATA.ISP_TvBuffer[4]=ISP_ANSWER_ACK;		//应答
		
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitCommand;		//ISP等待命令（作为从机)--处理完GetID命令后等待下一下命令
		rxNum=5;			//上报数据大小
	}
	else if(C0==ISP_COMMAND_RM)			//从应用程序指定的地址开始读取最多 256 个字节的存储器空间：读数据分五步：1-读数据命令，2-读数据起始地址，3-需要读取的长度，4-读数据过程，5-上报数据
	{
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitRAddr;			//ISP等待待读取地址---从机接收到读数据命令后应答，然后等待待读取数据地址
		Usart_ISP_ACK(ISP_Conf);															//ISP应答
		return;
	}
	else if(C0==ISP_COMMAND_Go)			//等待待跳转到内部 Flash 或 SRAM 内的应用程序代码地址//Go 命令用于从应用程序指定的地址开始执行已下载的代码或其它任何代码
	{
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitGoAddr;			//接收到Go命令后，应答，然后等待开始执行起始地址
		Usart_ISP_ACK(ISP_Conf);	//ISP应答
	}
	else if(C0==ISP_COMMAND_WM)			//Write Memory:从应用程序指定的地址开始将最多 256 个字节的数据写入 RAM 或 Flash
	{
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitWAddr;			//ISP等待待写入地址---接收到写命令后，应答，然后等待写入起始地址
		Usart_ISP_ACK(ISP_Conf);	//ISP应答
	}
	else if(C0==ISP_COMMAND_Erase)	//擦除一个到全部 Flash 页面
	{
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitEraseAddr;	//ISP等待待擦除地址，接收到擦除命令后，应答，等待输入待擦除地址（全部擦除或者页擦除）
		Usart_ISP_ACK(ISP_Conf);	//ISP应答
	}
	else if(C0==ISP_COMMAND_EE)			//使用双字节寻址模式擦除一个到全部 Flash 页面（仅用于v3.0 usart 自举程序版本及以上版本）。
	{
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitEraseAddr;	//ISP等待待擦除地址，接收到擦除命令后，应答，等待输入待擦除地址（全部擦除或者页擦除）
		Usart_ISP_ACK(ISP_Conf);	//ISP应答
	}
	else if(C0==ISP_COMMAND_WP)			//使能某些扇区的写保护
	{
		/*Write Protect 命令用于为一部分或所有 Flash 扇区使能写保护。自举程序接收到 Write Protect 命令后，
			会将 ACK 字节发送到主机。发送 ACK 字节后，自举程序将等待要接收的 字节数（受保护的扇区），之后从应用程序接收 Flash 扇区代码。
			在 Write Protect 命令结束时，自举程序会发送 ACK 字节并启动系统复位，以实施新的选项 字节配置。
		*/
		return;			//暂不处理
	}
	else if(C0==ISP_COMMAND_WU)			//关闭所有 Flash 扇区的写保护
	{
		/*Write Unprotect 命令用于禁止所有 Flash 扇区的写保护。自举程序接收到 Write Unprotect 命令后，
		会将 ACK 字节发送到主机。发送 ACK 字节后，自举程序会禁止所有 Flash 扇区的 写保护。执行禁止保护操作后，自举程序发送 ACK 字节。
		在 Write Unprotect 命令结束时，自举程序会发送 ACK 字节并启动系统复位，以实施新的选项 字节配置。
		*/
		return;			//暂不处理
	}
	else if(C0==ISP_COMMAND_RP)			//使能读保护
	{
		/*Readout Protect 命令用于使能 Flash 读保护。自举程序接收到 Readout Protect 命令后，
			会将 ACK 字节发送到主机。发送 ACK 字节后，自举程序将使能 Flash 的读保护。
			在 Readout Protect 命令结束时，自举程序会发送 ACK 字节并启动系统复位，以实施新的选 项字节配置。
		*/
		return;			//暂不处理
	}
	else if(C0==ISP_COMMAND_RU)			//关闭读保护
	{
		/*Readout Unprotect 命令用于禁止 Flash 读保护。自举程序接收到 Readout Unprotect 命令 后，会将 ACK 字节发送到主机。
			发送了 ACK 字节后，自举程序将擦除所有 Flash 扇区并禁 止整个 Flash 的读保护。如果擦除操作成功完成，自举程序将停用 RDP。
			如果擦除操作失败，自举程序会发送一个 NACK 且读保护仍然有效。
			在 Readout Unprotect 命令结束时，自举程序会发送 ACK 字节并启动系统复位，以实施新 的选项字节配置。
		*/
		return;			//暂不处理
	}
	else
	{
//		if(ISP_Conf->ISP_STEPS==Step_WaitRlen)	//等待接收需要读取的数据长度
//		{
//			if(ISP_Conf->ISP_STATUS==ISP_STATUS_WRITE)		//FLASH执行写操作
//			{
//				rxNum=ISP_Conf->ISP_RvBuffer[0];						//待读取的长度
//				ISP_Conf->ISP_TxBuffer[0]=ISP_ANSWER_ACK;		//应答位
//				memcpy(&ISP_Conf->ISP_TxBuffer[1], ISP_Conf->ISP_TvBuffer, rxNum+1);
//				rxNum+=2;
//				ISP_Conf->ISP_STEPS=Step_SendRData;		//发送读取的数据
//			}
//			else
//			{
//				rxNum=ISP_Conf->ISP_RvBuffer[0];						//待读取的长度
//				ISP_Conf->ISP_TxBuffer[0]=ISP_ANSWER_ACK;		//应答位
//				memset(&(ISP_Conf->ISP_TxBuffer[1]),0xFF, rxNum+1);
//				ISP_Conf->ISP_TxBuffer[1]=0X13;
//				ISP_Conf->ISP_TxBuffer[2]=0X79;
//				ISP_Conf->ISP_TxBuffer[3]=0X44;
//				ISP_Conf->ISP_TxBuffer[4]=0X68;
//				ISP_Conf->ISP_TxBuffer[5]=0X33;
//				ISP_Conf->ISP_TxBuffer[6]=0X7F;
//				rxNum+=2;
//				ISP_Conf->ISP_STEPS=Step_SendRData;		//发送读取的数据
//			}
//		}
//		else if(ISP_Conf->ISP_STEPS==Step_Erase)	//擦除
//		{
//			if(ISP_Conf->ISP_RvBuffer[0]==0xFF)			//全页擦除
//			{
//				ISP_Conf->ISP_STEPS=Step_EraseAll;		//发送读取的数据
//				//.....等待擦除完成
//				Usart_ISP_ACK(ISP_Conf);	//ISP应答
//				ISP_Conf->ISP_STEPS=Step_Start;				//复位步骤
//			}
//			else
//			{
//				ISP_Conf->ISP_STEPS=Step_ErasePage;		//擦除页
//				//.....等待擦除完成
//				Usart_ISP_ACK(ISP_Conf);	//ISP应答
//				ISP_Conf->ISP_STEPS=Step_Start;				//复位步骤
//			}
//		}
	}	
	if(rxNum)
	{
		memcpy(ISP_Conf->ISP_DATA.ISP_TxBuffer, ISP_Conf->ISP_DATA.ISP_TvBuffer, rxNum);
		USART_DMASend(ISP_Conf->USARTx,(u32*)ISP_Conf->ISP_DATA.ISP_TxBuffer,rxNum);	//串口DMA发送程序	
	}
}
/*******************************************************************************
* 函数名			:	Usart_ISP_ReadAddr
* 功能描述		:	ISP读地址
* 输入			: void
* 返回值			: void
*******************************************************************************/
void Usart_ISP_GetAddr(ISP_Conf_TypeDef *ISP_Conf)		//ISP获取写数据起始地址(主机->从机)
{	
	//ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitRAddr||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWAddr||ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitEraseAddr)
	//需要接收地址的指令：读数据，写数据，擦除
	if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitEraseAddr)			//ISP擦除操作，接收到擦除命令后，应答，等待输入待擦除地址（全部擦除或者页擦除）等待擦除完成，完成后应答
	{
		unsigned char C0=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];
		unsigned char C1=ISP_Conf->ISP_DATA.ISP_RvBuffer[1];
		C1=C1^0XFF;
		if(C0!=C1)
		{
			return;
		}
		ISP_Conf->ISP_DATA.WriteAddr=C0;													//待写数据的起始地址--擦除为写入0xFF
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitErase;						//等待接收待写入的数据
	}
	else
	{
		unsigned int addr=0x00;		//合并地址变量
		unsigned char Bcc=BCC8(ISP_Conf->ISP_DATA.ISP_RvBuffer,4);		//异或校验;
		if(Bcc!=ISP_Conf->ISP_DATA.ISP_RvBuffer[4])
		{
			return;
		}
		else		//合并地址---4字节
		{		
			addr=	(ISP_Conf->ISP_DATA.ISP_RvBuffer[0])<<24;
			addr+=(ISP_Conf->ISP_DATA.ISP_RvBuffer[1])<<16;
			addr+=(ISP_Conf->ISP_DATA.ISP_RvBuffer[2])<<8;
			addr+=(ISP_Conf->ISP_DATA.ISP_RvBuffer[3]);
		}
		if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitRAddr)					//等待接收读数据起地址，接收到地址后应答，再等待待读取数据长度
		{
			ISP_Conf->ISP_DATA.ReadAddr=addr;														//待读数据的起始地址
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitLengh;						//等待接收需要读取的数据长度
			Usart_ISP_ACK(ISP_Conf);	//ISP应答
		}
		else if(ISP_Conf->ISP_SLAVE_STATUS==ISP_STATUS_WaitWAddr)			//等待接收写数据地址，接收到地址后应答，再等待待写入的数据
		{
			ISP_Conf->ISP_DATA.WriteAddr=addr;													//待写数据的起始地址
			ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitWData;						//等待接收待写入的数据
			Usart_ISP_ACK(ISP_Conf);	//ISP应答
		}
	}
//	if(ISP_Conf->ISP_STEPS==Step_WaitRaddr)		//当前状态为等待接收需要读取数据的起始地址
//	{
//		
//		
//		ISP_Conf->ReadAddr=addr;
//		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitLengh;		//ISP等待命令（作为从机)
//		Usart_ISP_ACK(ISP_Conf);						//ISP应答
//	}
//	else if(ISP_Conf->ISP_STEPS==Step_WaitWaddr)		//等待接收需要写入的数据起始地址
//	{
//		if(ISP_Conf->ISP_STATUS==ISP_STATUS_Go)		//跳转到内部 Flash 或 SRAM 内的应用程序代码
//		{
//			unsigned int addr=0x00;
//			addr=(ISP_Conf->ISP_RvBuffer[0])<<24;
//			addr+=(ISP_Conf->ISP_RvBuffer[1])<<16;
//			addr+=(ISP_Conf->ISP_RvBuffer[2])<<8;
//			addr+=(ISP_Conf->ISP_RvBuffer[3]);
//			
//			ISP_Conf->ISP_STATUS=ISP_STATUS_IDLE;	//FLASH空闲状态，可以读写
//			ISP_Conf->ISP_STEPS=Step_Start;				//起始步骤，当前为空闲
//			
//			Usart_ISP_ACK(ISP_Conf);							//ISP应答
//			
//			Usart_ISP_Reset(ISP_Conf);						//重置编程器---恢复所有参数为默认值
//		}
//		else
//		{
//			unsigned int addr=0x00;
//			addr=(ISP_Conf->ISP_RvBuffer[0])<<24;
//			addr+=(ISP_Conf->ISP_RvBuffer[1])<<16;
//			addr+=(ISP_Conf->ISP_RvBuffer[2])<<8;
//			addr+=(ISP_Conf->ISP_RvBuffer[3]);
//			
//			ISP_Conf->WriteAddr=addr;						//存储地址
//			ISP_Conf->ISP_STEPS=Step_WaitWData;	//等待接收需要写入的数据长度
//			Usart_ISP_ACK(ISP_Conf);						//ISP应答
//		}
//	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_ISP_SetAddr(ISP_Conf_TypeDef *ISP_Conf)					//ISP设置写数据起始地址(主机->从机)
{
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_ISP_GetLengh(ISP_Conf_TypeDef *ISP_Conf)				//ISP获取需要读取的数据长度(主机->从机)，读数据时，传入地址后再传入待读取的数据长度
{
	//ISP获取需要读取的数据长度(主机->从机)，读数据时，传入地址后再传入待读取的数据长度，接收到长度数据后执行读数据操作，然后上传数据
	unsigned short rxNum=0;
	unsigned char C0=ISP_Conf->ISP_DATA.ISP_RvBuffer[0];
	unsigned char C1=ISP_Conf->ISP_DATA.ISP_RvBuffer[1];
	C1=C1^0XFF;
	if(C0!=C1)		//校验地址
	{
		return;
	}
	else
	{
		ISP_Conf->ISP_DATA.ReadLen=C0;										//待读取的数据长度
		ISP_Conf->ISP_SLAVE_STATUS=ISP_STATUS_WaitRData;	//ISP等待读数据操作
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	函数功能说明
*输入				: 
*返回值			:	无
*******************************************************************************/
void Usart_ISP_SetLengh(ISP_Conf_TypeDef *ISP_Conf)				//ISP获取需要读取的数据长度(主机->从机)
{

